
x = int(input('Введите четырёхзначное число: ')) # запрос данных у пользователя

x1 = x // 1000 # подсчёт цифры в позиции тысяч
x2 = (x // 100) % 10 # подсчёт цифры в позиции сотен
x3 = (x // 10) % 10 # подсчёт цифры в позиции десятков
x4 = x % 10 # подсчёт цифры в позиции единиц

print("Цифра в позиции тысяч равна", x1) # вывод результата
print("Цифра в позиции сотен равна", x2) # вывод результата
print("Цифра в позиции десятков равна", x3) # вывод результата
print("Цифра в позиции единиц равна", x4) # вывод результата
